## Plan for org_account/aft
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 31 to add, 36 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_create_role will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_create_role" {
        id     = "aft-account-provisioning-framework-lambda-create-role-role:aft-lambda-invoke-aft_account_provisioning_framework-create-role-policy"
        name   = "aft-lambda-invoke-aft_account_provisioning_framework-create-role-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "sns:Publish",
                        ]
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_get_account_info will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_get_account_info" {
        id     = "aft-account-provisioning-framework-lambda-get-account-info-role:aft-lambda-invoke-aft-account-provisioning-framework-get-account-info-policy"
        name   = "aft-lambda-invoke-aft-account-provisioning-framework-get-account-info-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "sns:Publish",
                        ]
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_persist_metadata will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_persist_metadata" {
        id     = "aft-account-provisioning-framework-lambda-persist-metadata-role:aft-lambda-invoke-aft-account-provisioning-framework-persist-metadata-policy"
        name   = "aft-lambda-invoke-aft-account-provisioning-framework-persist-metadata-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "sns:Publish",
                        ]
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_tag_account will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_tag_account" {
        id     = "aft-account-provisioning-framework-lambda-tag-account-role:aft-lambda-invoke-aft-account-provisioning-framework-tag-account-policy"
        name   = "aft-lambda-invoke-aft-account-provisioning-framework-tag-account-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "sns:Publish",
                        ]
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_validate_request will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_validate_request" {
        id     = "aft-account-provisioning-framework-validate-request-lambda-role:aft-lambda-invoke-aft-account-provisioning-framework-validate-request-policy"
        name   = "aft-lambda-invoke-aft-account-provisioning-framework-validate-request-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = "ssm:GetParameter"
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:ca-central-1:137554749751:parameter/aft/*",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            "sts:AssumeRole",
                          - "sns:Publish",
                        ]
                        # (2 unchanged elements hidden)
                    },
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be updated in-place
  ~ resource "aws_lambda_function" "account_metadata_ssm" {
        id                             = "aft-account-provisioning-framework-account-metadata-ssm"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be updated in-place
  ~ resource "aws_lambda_function" "create_role" {
        id                             = "aft-account-provisioning-framework-create-aft-execution-role"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.get_account_info will be updated in-place
  ~ resource "aws_lambda_function" "get_account_info" {
        id                             = "aft-account-provisioning-framework-get-account-info"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be updated in-place
  ~ resource "aws_lambda_function" "persist_metadata" {
        id                             = "aft-account-provisioning-framework-persist-metadata"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be updated in-place
  ~ resource "aws_lambda_function" "tag_account" {
        id                             = "aft-account-provisioning-framework-tag-account"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.validate_request will be updated in-place
  ~ resource "aws_lambda_function" "validate_request" {
        id                             = "aft-account-provisioning-framework-validate-request"
      ~ last_modified                  = "2022-03-30T14:58:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk=" -> "98+yMm4NmQ/v/ZGZJ9XRv2HA7hoeD/aqdCAqTcMh3YY="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_action_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_action_trigger" {
        id                             = "aft-account-request-action-trigger"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "1Itd8EaUAz8Sg9LWPxdQ4sc8uzdhHak02/jBmKMHNTk=" -> "+ILgF4wIVzjFBCXS/t7tLSnyOfY+B6qCF8HbdFg+jos="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_audit_trigger will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_audit_trigger" {
        id                             = "aft-account-request-audit-trigger"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "1Itd8EaUAz8Sg9LWPxdQ4sc8uzdhHak02/jBmKMHNTk=" -> "+ILgF4wIVzjFBCXS/t7tLSnyOfY+B6qCF8HbdFg+jos="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_account_request_processor will be updated in-place
  ~ resource "aws_lambda_function" "aft_account_request_processor" {
        id                             = "aft-account-request-processor"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "1Itd8EaUAz8Sg9LWPxdQ4sc8uzdhHak02/jBmKMHNTk=" -> "+ILgF4wIVzjFBCXS/t7tLSnyOfY+B6qCF8HbdFg+jos="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_controltower_event_logger will be updated in-place
  ~ resource "aws_lambda_function" "aft_controltower_event_logger" {
        id                             = "aft-controltower-event-logger"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "1Itd8EaUAz8Sg9LWPxdQ4sc8uzdhHak02/jBmKMHNTk=" -> "+ILgF4wIVzjFBCXS/t7tLSnyOfY+B6qCF8HbdFg+jos="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_lambda_function.aft_invoke_aft_account_provisioning_framework will be updated in-place
  ~ resource "aws_lambda_function" "aft_invoke_aft_account_provisioning_framework" {
        id                             = "aft-invoke-aft-account-provisioning-framework"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "1Itd8EaUAz8Sg9LWPxdQ4sc8uzdhHak02/jBmKMHNTk=" -> "+ILgF4wIVzjFBCXS/t7tLSnyOfY+B6qCF8HbdFg+jos="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.primary-backend-bucket-acl will be created
  + resource "aws_s3_bucket_acl" "primary-backend-bucket-acl" {
      + acl    = "private"
      + bucket = "aft-backend-137554749751-primary-region"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_acl.secondary-backend-bucket-acl will be created
  + resource "aws_s3_bucket_acl" "secondary-backend-bucket-acl" {
      + acl    = "private"
      + bucket = "aft-backend-137554749751-secondary-region"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_replication_configuration.primary-backend-bucket-replication will be created
  + resource "aws_s3_bucket_replication_configuration" "primary-backend-bucket-replication" {
      + bucket = "aft-backend-137554749751-primary-region"
      + id     = (known after apply)
      + role   = "arn:aws:iam::137554749751:role/aft-s3-terraform-backend-replication"

      + rule {
          + id       = "0"
          + priority = 0
          + status   = "Enabled"

          + destination {
              + bucket        = "arn:aws:s3:::aft-backend-137554749751-secondary-region"
              + storage_class = "STANDARD"

              + encryption_configuration {
                  + replica_kms_key_id = "arn:aws:kms:us-east-1:137554749751:key/e383ce05-f398-4791-b398-bbf911994c5e"
                }
            }

          + source_selection_criteria {

              + sse_kms_encrypted_objects {
                  + status = "Enabled"
                }
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.primary-backend-bucket-encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "primary-backend-bucket-encryption" {
      + bucket = "aft-backend-137554749751-primary-region"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ca-central-1:137554749751:key/cb27cd10-0c62-4c09-89e9-6e89af441c96"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_server_side_encryption_configuration.secondary-backend-bucket-encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "secondary-backend-bucket-encryption" {
      + bucket = "aft-backend-137554749751-secondary-region"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:us-east-1:137554749751:key/e383ce05-f398-4791-b398-bbf911994c5e"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.primary-backend-bucket-versioning will be created
  + resource "aws_s3_bucket_versioning" "primary-backend-bucket-versioning" {
      + bucket = "aft-backend-137554749751-primary-region"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.account_factory_for_terraform.module.aft_backend.aws_s3_bucket_versioning.secondary-backend-bucket-versioning will be created
  + resource "aws_s3_bucket_versioning" "secondary-backend-bucket-versioning" {
      + bucket = "aft-backend-137554749751-secondary-region"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_codebuild_customizations_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_codebuild_customizations_policy" {
        id     = "aft-codebuild-customizations-role:terraform-20220314181228083800000027"
        name   = "terraform-20220314181228083800000027"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (8 unchanged elements hidden)
                    {
                        Action   = [
                            "sts:AssumeRole",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::137554749751:role/AWSAFTAdmin",
                        ]
                    },
                  ~ {
                      ~ Resource = [
                          - "arn:aws:dynamodb:137554749751:137554749751:table/aft*",
                          + "arn:aws:dynamodb:ca-central-1:137554749751:table/aft*",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_customizations_invoke_account_provisioning_lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_customizations_invoke_account_provisioning_lambda" {
        id     = "aft-customizations-invoke-account-provisioning-role:aft-customizations-invoke-account-provisioning-policy"
        name   = "aft-customizations-invoke-account-provisioning-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:Decrypt",
                            "kms:Encrypt",
                            "kms:GenerateDataKey",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ca-central-1:137554749751:key/ea20f7e6-a30d-4de6-90a8-bbcec36d0d00"
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_execute_pipeline_lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_execute_pipeline_lambda" {
        id     = "aft-execute-pipeline-execution-role:aft-execute-pipeline-policy"
        name   = "aft-execute-pipeline-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = "sts:GetCallerIdentity"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_get_pipeline_executions_lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_get_pipeline_executions_lambda" {
        id     = "aft-get-pipeline-status-execution-role:aft-get-pipeline-status-policy"
        name   = "aft-get-pipeline-status-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Encrypt",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ca-central-1:137554749751:key/ea20f7e6-a30d-4de6-90a8-bbcec36d0d00",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_iam_role_policy.aft_identify_targets_lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "aft_identify_targets_lambda" {
        id     = "aft-identify-targets-execution-role:aft-identify-targets-policy"
        name   = "aft-identify-targets-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Encrypt",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ca-central-1:137554749751:key/ea20f7e6-a30d-4de6-90a8-bbcec36d0d00",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-notifications",
                          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
                        ]
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.account_factory_for_terraform.module.aft_customizations.aws_lambda_function.aft_customizations_execute_pipeline will be updated in-place
  ~ resource "aws_lambda_function" "aft_customizations_execute_pipeline" {
        id                             = "aft-customizations-execute-pipeline"
      ~ last_modified                  = "2022-03-30T14:58:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:137554749751:layer:aft-common-1-3-5:1",
        ] -> (known after apply)
      ~ source_code_hash               = "VZXIi+rT2xWPWhzOLVlJDO8+pAvKEoZoLivMuLMp53w=" ->...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.get_account_info"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.validate_request"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_get_account_info"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
